// config.js
window.BATT_CONFIG = {
  app: {
    title: "8109 – ניהול כוח אדם",
    battalion_name_default: "8109"
  },

  // ⚠️ POC בלבד: סיסמה בצד לקוח
  auth: {
    simple_password: "8109"
  },

  roles: [
    "ק.שלישות",
    'שבצ"ק',
    'מ"פ',
    'מג"ד'
  ],

  forces: [
    "פלוגה א",
    "פלוגה ב",
    "פלוגה ג",
    "מסייעת",
    "מפקדה",
    "גדוד"
  ],

  // תפקידים לבחירה
  jobs: [
    "ללא",
    "לוחם",
    "חובש",
    "מפקד כיתה",
    'מ"מ',
    "מטול",
    "קלע",
    "נהג האמר",
    "נהג סופה",
    "נהג סופה ממוגנת"
  ]
};
